{
  "class_name": "Sequential",
  "config": {
    "name": "sequential",
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null, 178],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "embedding_input"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Embedding",
        "config": {
          "name": "embedding",
          "trainable": true,
          "dtype": "float32",
          "batch_input_shape": [null, 178],
          "input_dim": 1314,
          "output_dim": 128,
          "embeddings_initializer": {
            "module": "keras.initializers",
            "class_name": "RandomUniform",
            "config": { "minval": -0.05, "maxval": 0.05, "seed": null },
            "registered_name": null
          },
          "embeddings_regularizer": null,
          "activity_regularizer": null,
          "embeddings_constraint": null,
          "mask_zero": false,
          "input_length": 178
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 178] }
      },
      {
        "module": "keras.layers",
        "class_name": "GRU",
        "config": {
          "name": "gru",
          "trainable": true,
          "dtype": "float32",
          "return_sequences": false,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "time_major": false,
          "units": 400,
          "activation": "tanh",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "recurrent_initializer": {
            "module": "keras.initializers",
            "class_name": "Orthogonal",
            "config": { "gain": 1.0, "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 2,
          "reset_after": true
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 178, 128] }
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "dropout",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 400] }
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": "float32",
          "units": 1164,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 400] }
      }
    ]
  },
  "keras_version": "2.15.0",
  "backend": "tensorflow"
}
